In [1]:
import mysql.connector as sql
import pandas as pd
from mysql.connector import Error

## Problem Statement 18:

In [2]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = sql.connect(host=host_name, user=user_name, passwd=user_password)
        print("MySQL Database connection successful")
    except Error as err:
        print(f"The error '{err}' occurred")

    return connection

pw = "Pratham123***"
connection = create_server_connection("localhost", "root", pw)

MySQL Database connection successful

In [3]:
def create_db(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"The error '{err}' occurred")


connection = create_db(connection, "CREATE DATABASE if not exists healthcare_db")

Database created successfully

In [4]:
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = sql.connect(host=host_name, user=user_name, passwd=user_password, database=db_name)
        print("MySQL Database connection successful")
    except Error as err:
        print(f"The error '{err}' occurred")

    return connection

connection = create_db_connection("localhost", "root", pw, "healthcare_db")

MySQL Database connection successful

In [5]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"The error '{err}' occurred")

In [6]:
def run_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        columns = [column[0] for column in cursor.description]
        df = pd.DataFrame(result, columns=columns)
        return df
    except Error as err:
        print(f"The error '{err}' occurred")

In [7]:
execute_query(connection, "USE healthcare_db")

Query successful

In [8]:
execute_query(connection, """CREATE TABLE IF NOT EXISTS census (
    District VARCHAR(255),
    State/UT VARCHAR(255),
    Population INT,
    Male BIGINT,
    Female INT,
    Literate INT,
    Literate_Male INT,
    Literate_Female INT,
    Households_Rural INT,
    Households_Urban INT,
    Households INT,
    Young_and_Adult INT,
    Middle_Aged INT,
    Senior_Citizen INT,
    Age_Not_Stated INT,
    PRIMARY KEY (District)
);""")

The error '1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '/UT VARCHAR(255),
    Population INT,
    Male BIGINT,
    Female INT,
    Liter' at line 3' occurred

In [9]:
execute_query(connection, """CREATE TABLE IF NOT EXISTS housing(
District VARCHAR(255),
    Households_Rural INT,
    Households_Rural_Livable INT,
    Households_Rural_Dilapidated INT,
    Households_Rural_Toilet_Premise INT,
    Households_Urban INT,
    Households_Urban_Livable INT,
    Households_Urban_Dilapidated INT,
    Households_Urban_Toilet_Premise INT,
    PRIMARY KEY (District),
    FOREIGN KEY (District) REFERENCES census(District)
);
""")

Query successful

In [10]:
execute_query(connection, """
              CREATE TABLE IF NOT EXISTS all_hospitals(
    State/UT VARCHAR(255),
    Number_of_Primary_Health_Centers_PHCs INT,
    Community_Health_Centers_CHCs INT,
    Sub_District_Divisional_Hospitals_SDHs INT,
    District_Hospitals_DHs INT,
    Hospitals INT,
    HospitalBeds INT,
    PRIMARY KEY (State/UT)
);
""")

The error '1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '/UT VARCHAR(255),
    Number_of_Primary_Health_Centers_PHCs INT,
    Community_H' at line 2' occurred

In [11]:
execute_query(connection,""" CREATE TABLE IF NOT EXISTS government_hospital (
    State/UT VARCHAR(255),
    Rural_government_hospital INT,
    Rural_Government_Beds INT,
    Urban_government_hospital INT,
    Urban_Government_Beds INT,
    Last_Updated DATE,
    PRIMARY KEY (State/UT),
    FOREIGN KEY (State/UT) REFERENCES all_hospitals(State/UT)
);""")

The error '1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '/UT VARCHAR(255),
    Rural_government_hospital INT,
    Rural_Government_Beds I' at line 2' occurred

## Problem Statement 19:

In [12]:
run_query(connection, """SELECT *
FROM census
INNER JOIN housing ON census.`District Name`= housing.District
INNER JOIN all_hospitals ON census.`State/UT` = all_hospitals.`State/UT`
INNER JOIN government_hospital ON all_hospitals.`State/UT` = government_hospital.`State/UT`
LIMIT 3""")

,State/UT,District Name,Population,Male,Female,Literate,Literate_Male,Literate_Female,Households_Rural,Households_Urban,...,Sub-District/Divisional Hospitals(SDHs),District Hospitals(DHs),Hospitals,HospitalBeds,State/UT,Rural_Government_Hospitals,Rural_Government_Beds,Urban_Government_Hospitals,Urban_Government_Beds,Last_Updated
0,Himachal Pradesh,Chamba,519080,261320,257760,323842,186064,137778,186395,13836,...,61,15,671,8706,Himachal Pradesh,705,5665,96,6734,31-12-2017
1,Himachal Pradesh,Kangra,1510075,750591,759484,1152640,606443,546197,588321,39007,...,61,15,671,8706,Himachal Pradesh,705,5665,96,6734,31-12-2017
2,Himachal Pradesh,Kullu,437903,225452,212451,307672,174550,133122,167995,20709,...,61,15,671,8706,Himachal Pradesh,705,5665,96,6734,31-12-2017

## Problem Statement 21

In [13]:
execute_query(connection, """
              DROP FUNCTION IF EXISTS get_population_district;
              """)

Query successful

In [14]:
execute_query(connection, """
              CREATE FUNCTION IF NOT EXISTS get_population_district(district_name TEXT)
              RETURNS INT
              DETERMINISTIC
              BEGIN
              DECLARE result INT;
              SELECT Population INTO result FROM census WHERE `District Name` = district_name;
              RETURN result;
              END;
              """)

Query successful

In [15]:
run_query(connection, "SELECT get_population_district('Ahmadabad')")

   get_population_district('Ahmadabad')
0                               7214225

In [16]:
execute_query(connection, """
              DROP FUNCTION IF EXISTS get_population_state;
              """)

Query successful

In [17]:
execute_query(connection,"""
              CREATE FUNCTION IF NOT EXISTS get_population_state(state_name TEXT)
RETURNS INT
DETERMINISTIC
BEGIN
    DECLARE result INT;
    SELECT SUM(Population) INTO result
    FROM census
    WHERE `State/UT` = state_name
    GROUP BY `State/UT`;
    RETURN COALESCE(result, 0);
END;
              """)

Query successful

In [18]:
run_query(connection, "SELECT get_population_state('Gujarat');")

   get_population_state('Gujarat')
0                         58404628

In [19]:
execute_query(connection, """
              DROP FUNCTION IF EXISTS senior_citizen_population;
              """)

Query successful

In [20]:
execute_query(connection, """
              CREATE FUNCTION IF NOT EXISTS senior_citizen_population(state_name TEXT)
              RETURNS INT
              DETERMINISTIC
              BEGIN
              DECLARE result INT;
              SELECT SUM(Senior_Citizen) INTO result FROM census WHERE `State/UT` = state_name;
              RETURN result;
              END;
              """)

Query successful

In [21]:
run_query(connection, "SELECT senior_citizen_population('Gujarat');")

   senior_citizen_population('Gujarat')
0                               9181111

In [22]:
execute_query(connection, """
              DROP FUNCTION IF EXISTS get_hospital_beds;
              """)

Query successful

In [23]:
execute_query(connection, """
              CREATE FUNCTION IF NOT EXISTS get_hospital_beds(state_name TEXT)
              RETURNS INT
              DETERMINISTIC
              BEGIN
              DECLARE result INT;
              SELECT HospitalBeds INTO result FROM all_hospitals WHERE `State/UT` = `State_Name`;
              RETURN result;
              END;
              """)

Query successful

In [24]:
run_query(connection, "SELECT get_hospital_beds('Gujarat');")

   get_hospital_beds('Gujarat')
0                         41129

In [25]:
execute_query(connection, "DROP FUNCTION IF EXISTS get_govt_hospital_beds;")

Query successful

In [26]:
execute_query(connection, """
              CREATE FUNCTION IF NOT EXISTS get_govt_hospital_beds(state_name TEXT)
              RETURNS INT
              DETERMINISTIC
              BEGIN
              DECLARE result INT;
              SELECT Urban_Government_Beds+Rural_Government_Beds INTO result FROM government_hospital WHERE `State/UT` = state_name;
              RETURN result;
              END;
              """)

Query successful

In [27]:
run_query(connection, "SELECT get_govt_hospital_beds('Gujarat');")

   get_govt_hospital_beds('Gujarat')
0                              32280

In [28]:
execute_query(connection, "DROP FUNCTION IF EXISTS beds_per_lakh;")

Query successful

In [29]:
execute_query(connection, """
              CREATE FUNCTION IF NOT EXISTS beds_per_lakh(state_name TEXT)
              RETURNS FLOAT
              DETERMINISTIC
              BEGIN
              DECLARE result FLOAT;
              SELECT (get_hospital_beds(state_name)/(get_population_state(state_name))*100000) INTO result;
              RETURN result;
              END;
              """)

Query successful

In [30]:
run_query(connection, "SELECT beds_per_lakh('Gujarat');")

   beds_per_lakh('Gujarat')
0                   70.4207

In [31]:
execute_query(connection, "DROP FUNCTION IF EXISTS govt_beds_per_lakh;")

Query successful

In [32]:
execute_query(connection, """
              CREATE FUNCTION IF NOT EXISTS govt_beds_per_lakh(state_name TEXT)
              RETURNS FLOAT
              DETERMINISTIC
              BEGIN
              DECLARE result FLOAT;
              SELECT (get_govt_hospital_beds(state_name)/(get_population_state(state_name))*100000) INTO result;
              RETURN result;
              END;
              """)

Query successful

In [33]:
run_query(connection, "SELECT govt_beds_per_lakh('Gujarat');")

   govt_beds_per_lakh('Gujarat')
0                        55.2695

In [34]:
execute_query(connection, "DROP FUNCTION IF EXISTS get_govt_hospital;")

Query successful

In [35]:
execute_query(connection, """
              CREATE FUNCTION IF NOT EXISTS get_govt_hospital(state_name TEXT)
              RETURNS INT
              DETERMINISTIC
              BEGIN
              DECLARE result INT;
              SELECT (Rural_Government_Hospitals+Urban_Government_Hospitals) INTO result FROM government_hospital WHERE `State/UT` = state_name;
              RETURN result;
              END;
              """)

Query successful

In [36]:
run_query(connection, "SELECT get_govt_hospital('Gujarat');")

   get_govt_hospital('Gujarat')
0                           486

## Problem Statement 20:

In [37]:
run_query(connection, """
            SELECT `State/UT`, MIN((get_hospital_beds(`State/UT`)/get_population_state(`State/UT`))) AS `hospital beds to population ratio`
            FROM all_hospitals
            GROUP BY `State/UT`
            HAVING MIN((get_hospital_beds(`State/UT`)/get_population_state(`State/UT`)))
            ORDER BY `hospital beds to population ratio`
            LIMIT 5;

        """)

         State/UT hospital beds to population ratio
0           Bihar                            0.0002
1       Jharkhand                            0.0002
2  Madhya Pradesh                            0.0005
3          Punjab                            0.0005
4       Telangana                            0.0005

In [38]:
run_query(connection, """
        SELECT
        c.`District Name`,
        SUM(h.Households_Rural + h.Households_Urban - h.Households_Rural_Toilet_Premise - h.Households_Urban_Toilet_Premise) AS 'Households without Toilet Premise'
        FROM
        census c
        INNER JOIN
        housing h ON c.`District Name` = h.District
        WHERE
        c.`State/UT` IN ('Bihar', 'Jharkhand') 
        GROUP BY
        c.`District Name`;
    """)

          District Name Households without Toilet Premise
0    Pashchim Champaran                            787512
1       Purba Champaran                           1011930
2               Sheohar                            131848
3             Sitamarhi                            675951
4                Supaul                            535007
5                Araria                            635110
6            Kishanganj                            397737
7                Purnia                            686615
8               Katihar                            605366
9             Madhepura                            443017
10              Saharsa                            390897
11            Darbhanga                            749103
12          Muzaffarpur                            807622
13            Gopalganj                            441305
14                Siwan                            516719
15                Saran                            607771
16             Vaishali                            544056
17           Samastipur                            853732
18            Begusarai                            501713
19             Khagaria                            299684
20            Bhagalpur                            428343
21                Banka                            388570
22               Munger                            186398
23           Lakhisarai                            140943
24           Sheikhpura                             93615
25              Nalanda                            423983
26                Patna                            550920
27              Bhojpur                            369769
28                Buxar                            251015
29      Kaimur (Bhabua)                            282558
30               Rohtas                            434506
31           Aurangabad                           7239940
32                 Gaya                            606107
33               Nawada                            327804
34                Jamui                            302891
35            Jehanabad                            154122
36                Arwal                            110185
37               Garhwa                            269802
38               Chatra                            192694
39              Kodarma                            125126
40              Giridih                            444461
41                Godda                            260083
42            Sahibganj                            220051
43                Pakur                            194821
44              Dhanbad                            392216
45               Bokaro                            330195
46            Lohardaga                             94040
47      Purbi Singhbhum                            292863
48               Palamu                            351061
49              Latehar                            142087
50           Hazaribagh                            302099
51              Ramgarh                            166744
52                Dumka                            293203
53               Ranchi                            430044
54                Gumla                            207946
55              Simdega                            142285
56  Pashchimi Singhbhum                            350518
57  Saraikela-Kharsawan                            227641

## Problem Statement 22:

In [39]:
with open('Data/north_east_states.txt', 'r') as f:
    north_east_states = f.read().splitlines()
north_east_states

['Arunachal Pradesh',
 'Assam',
 'Manipur',
 'Meghalaya',
 'Mizoram',
 'Nagaland',
 'Tripura ']

In [40]:
run_query(connection,"""
            SELECT `State/UT` AS State_Name, 
            get_population_state(`State/UT`) AS Population,
            senior_citizen_population(`State/UT`) AS `Senior Citizen Population`,
            get_govt_hospital(`State/UT`) AS `Number of Government Hospital`,
            get_govt_hospital_beds(`State/UT`) AS `Number of Government Hospital beds`,
            ROUND(govt_beds_per_lakh(`State/UT`)) AS `Number of Government Hospital Beds for 1L population`,
            ROUND(get_govt_hospital_beds(`State/UT`)/(senior_citizen_population(`State/UT`))*100000) as `Number of Government Hospital beds for 1L senior citizen`
            FROM census 
            WHERE `State/UT` IN ('Arunachal Pradesh','Assam','Manipur','Meghalaya','Mizoram','Nagaland','Tripura ')
            Group By `State/UT`
            ORDER BY govt_beds_per_lakh(`State/UT`) ASC
            """)

,State_Name,Population,Senior Citizen Population,Number of Government Hospital,Number of Government Hospital beds,Number of Government Hospital Beds for 1L population,Number of Government Hospital beds for 1L senior citizen
0,Manipur,2855794,409796,30,1427,50.0,348
1,Assam,31205576,4127732,1226,17142,55.0,415
2,Nagaland,1978502,211983,36,1880,95.0,887
3,Meghalaya,2966889,287754,157,4457,150.0,1549
4,Mizoram,1097206,144061,90,1997,182.0,1386
5,Arunachal Pradesh,1299780,131142,218,2404,185.0,1833

## Problem Statement 23

In [41]:
execute_query(connection, "DROP PROCEDURE IF EXISTS district_wise_report;")

Query successful

In [42]:
execute_query(connection, """
            CREATE PROCEDURE district_wise_report (IN district VARCHAR(255))
BEGIN
    SELECT 
        c.`District Name`, 
        c.`State/UT`, 
        h.`Households_Rural`, 
        h.`Households_Urban`, 
        h.`Households_Rural_Toilet_Premise`,
        h.`Households_Urban_Toilet_Premise`, 
        h.`Households_Rural_Dilapidated`,
        h.`Households_Urban_Dilapidated`, 
        h.`Households_Rural_Livable`, 
        h.`Households_Urban_Livable`, 
        ROUND((h.`Households_Rural_Toilet_Premise` + h.`Households_Urban_Toilet_Premise`)/h.`Households_Rural`*100,2) AS `Percentage of Households without Toilet Premise` 
    FROM 
        census c 
    INNER JOIN 
        housing h ON c.`District Name` = h.District 
    WHERE 
        c.`District Name` = district;
END;
""")

Query successful

In [43]:
run_query(connection, "CALL district_wise_report('Pali');")

,District Name,State/UT,Households_Rural,Households_Urban,Households_Rural_Toilet_Premise,Households_Urban_Toilet_Premise,Households_Rural_Dilapidated,Households_Urban_Dilapidated,Households_Rural_Livable,Households_Urban_Livable,Percentage of Households without Toilet Premise
0,Pali,Rajasthan,512909,139808,95913,96607,27697,3495,256967,46416,37.53